app/Models/PengaduanModel.php

    public function getPengaduan()
    {
        return $this->select('pengaduan.*, users.nama')
            ->join('users', 'users.id_user = pengaduan.id_user')
            ->orderBy('tanggal', 'DESC')
            ->findAll();
---
SELECT `pengaduan`.*, `users`.`nama`
FROM `pengaduan`
JOIN `users` ON `users`.`id_user` = `pengaduan`.`id_user`
ORDER BY `pengaduan`.`tanggal` DESC

    public function getDetail($id)
{
    return $this->select('pengaduan.*, users.nama')
                ->join('users', 'users.id_user = pengaduan.id_user')
                ->where('id_pengaduan', $id)
                ->first(); // wajib pakai first() agar hanya 1 record
---
SELECT `pengaduan`.*, `users`.`nama`
FROM `pengaduan`
JOIN `users` ON `users`.`id_user` = `pengaduan`.`id_user`
WHERE `id_pengaduan` = '1'
 LIMIT 1