app/Models/TanggapanModel.php

    public function getTanggapan()
    {
        return $this->select('tanggapan.*, users.nama, pengaduan.judul')
            ->join('users', 'users.id_user = tanggapan.id_user')
            ->join('pengaduan', 'pengaduan.id_pengaduan = tanggapan.id_pengaduan')
            ->findAll();
---
SELECT `tanggapan`.*, `users`.`nama`, `pengaduan`.`judul`
FROM `tanggapan`
JOIN `users` ON `users`.`id_user` = `tanggapan`.`id_user`
JOIN `pengaduan` ON `pengaduan`.`id_pengaduan` = `tanggapan`.`id_pengaduan`

    public function getByPengaduan($id_pengaduan)
    {
        return $this->where('id_pengaduan', $id_pengaduan)
            ->join('users', 'users.id_user = tanggapan.id_user')
            ->findAll();
---
SELECT *
FROM `tanggapan`
JOIN `users` ON `users`.`id_user` = `tanggapan`.`id_user`
WHERE `id_pengaduan` = '1'